backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Flatten
    config:
      batch_input_shape: !!python/tuple [null, 6]
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 240
      use_bias: true
  - class_name: Activation
    config: {activation: tanh, dtype: float32, name: activation, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotNormal
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 128
      use_bias: true
  - class_name: Activation
    config: {activation: tanh, dtype: float32, name: activation_1, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config: {dtype: float32, seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 574
      use_bias: true
  - class_name: Activation
    config: {activation: softmax, dtype: float32, name: activation_2, trainable: true}
  name: sequential
keras_version: 2.1.6-tf
